wosayttn/Gerrit_NuMicro/M2003xI_M2003xJ_Series/Library/Device/Nuvoton/M2003J/Include/adc_reg.h
     * |        |          |When the A/D conversion result of the selected channel meets setting condition in ADCMPR1 register, this bit is set to 1; it is cleared by writing 1 to it
     * |        |          |0 = Conversion result in ADDR does not meet ADCMPR1 setting.
     * |        |          |1 = Conversion result in ADDR meets ADCMPR1 setting.
     * |[7]     |BUSY      |BUSY/IDLE (Read Only)
     * |        |          |This bit is a mirror of ADST bit in ADCR register.
     * |        |          |0 = A/D converter is in idle state.
     * |        |          |1 = A/D converter is busy at conversion.
     * |[8]     |VALIDF    |Data Valid Flag (Read Only)
     * |        |          |If any one of VALID (ADDRx[17]) is set, this flag will be set to 1.
     * |        |          |Note: When ADC is in burst mode and any conversion result is valid, this flag will be set to 1.
     * |[16]    |OVERRUNF  |Overrun Flag (Read Only)
     * |        |          |If any one of OVERRUN (ADDRx[16]) is set, this flag will be set to 1.
     * |        |          |Note: When ADC is in burst mode and the FIFO is overrun, this flag will be set to 1.
     * |[24]    |ADCRDY    |ADC Power On Ready (Read Only)
     * |        |          |When ADEN (ADC_ADCR[0]) set to 1 or auto-operation Trigger to enable ADC, the ADC need a stable time
     * |        |          |The ADCRDY will keep low until ADC stable
     * |        |          |The ADC power ready time depends on STBSEL (ADC_ ADCR [25:24]).
     * |        |          |Note: ADC can start converting after ADCRDY is 1.
     * |[31:27] |CHANNEL   |Current Conversion Channel (Read Only)
     * |        |          |When BUSY=1, this filed reflects current conversion channel
     * |        |          |When BUSY=0, it shows the number of the next converted channel.
     * @var ADC_T::ADSR1
     * Offset: 0x94  ADC Status Register1
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[31:0]  |VALID     |Data Valid Flag (Read Only)
     * |        |          |VALID[29, 23:0] are the mirror of the VALID bits in ADDR29[17], ADDR23[17]~ ADDR0[17]
     * |        |          |The other bits are reserved.
     * |        |          |Note: When ADC is in burst mode and any conversion result is valid, VALID[29, 23:0] will be set to 1.
     * @var ADC_T::ADSR2
     * Offset: 0x98  ADC Status Register2
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[31:0]  |OVERRUN   |Overrun Flag (Read Only)
     * |        |          |OVERRUN[29, 23:0] are the mirror of the OVERRUN bit in ADDR29[16], ADDR23[16] ~ ADDR0[16]
     * |        |          |The other bits are reserved.
     * |        |          |Note: When ADC is in burst mode and the FIFO is overrun, OVERRUN[29, 23:0] will be set to 1.
     * @var ADC_T::ESMPCTL
     * Offset: 0xA0  ADC Extend Sample Time Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[13:0]  |EXTSMPT   |ADC Sampling Time Extend
     * |        |          |When A/D conversion at high conversion rate, the sampling time of analog input voltage may not enough if input channel loading is heavy, user can extend ADC sampling time after trigger source is coming to get enough sampling time.
     * |        |          |The range of start delay time is from 0~16367 ADC clock.
     * |        |          |Note: EXTSMPT will be set to 16367 if write a value more than 16367 in the register.
     * @var ADC_T::ADPDMA
     * Offset: 0x100  ADC PDMA Current Transfer Data Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[17:0]  |CURDAT    |ADC PDMA Current Transfer Data Register (Read Only)
     * |        |          |When PDMA transfers data, reading the register can monitor the current PDMA transfer data.
     * |        |          |Current PDMA transfer data could be the content of ADDR0 ~ ADDR23, ADDR29 registers.
     */
    __I  uint32_t ADDR[30];              /*!< [0x0000-0x0074] ADC Data Register 0 ~ 29                                  */
    __I  uint32_t RESERVE1[2];
    __IO uint32_t ADCR;                  /*!< [0x0080] ADC Control Register                                             */
    __IO uint32_t ADCHER;                /*!< [0x0084] ADC Channel Enable Register                                      */
    __IO uint32_t ADCMPR[2];             /*!< [0x0088-0x008c] ADC Compare Register 0/1                                  */
    __IO uint32_t ADSR0;                 /*!< [0x0090] ADC Status Register0                                             */
    __I  uint32_t ADSR1;                 /*!< [0x0094] ADC Status Register1                                             */
    __I  uint32_t ADSR2;                 /*!< [0x0098] ADC Status Register2                                             */
    __I  uint32_t RESERVE2[1];
    __IO uint32_t ESMPCTL;               /*!< [0x00a0] ADC Extend Sample Time Control Register                          */
    __I  uint32_t RESERVE3[23];
    __I  uint32_t ADPDMA;                /*!< [0x0100] ADC PDMA Current Transfer Data Register                          */
} ADC_T;

/**
    @addtogroup ADC_CONST ADC Bit Field Definition
    Constant Definitions for ADC Controller
@{ */

#define ADC_ADDR_RSLT_Pos                (0)                                               /*!< ADC_T::ADDR: RSLT Position            */
#define ADC_ADDR_RSLT_Msk                (0xfffful << ADC_ADDR_RSLT_Pos)                   /*!< ADC_T::ADDR: RSLT Mask                */

#define ADC_ADDR_OVERRUN_Pos             (16)                                              /*!< ADC_T::ADDR: OVERRUN Position         */
#define ADC_ADDR_OVERRUN_Msk             (0x1ul << ADC_ADDR_OVERRUN_Pos)                   /*!< ADC_T::ADDR: OVERRUN Mask             */

#define ADC_ADDR_VALID_Pos               (17)                                              /*!< ADC_T::ADDR: VALID Position           */
#define ADC_ADDR_VALID_Msk               (0x1ul << ADC_ADDR_VALID_Pos)                     /*!< ADC_T::ADDR: VALID Mask               */

#define ADC_ADDR0_RSLT_Pos               (0)                                               /*!< ADC_T::ADDR0: RSLT Position            */
#define ADC_ADDR0_RSLT_Msk               (0xfffful << ADC_ADDR0_RSLT_Pos)                  /*!< ADC_T::ADDR0: RSLT Mask                */

#define ADC_ADDR0_OVERRUN_Pos            (16)                                              /*!< ADC_T::ADDR0: OVERRUN Position         */
#define ADC_ADDR0_OVERRUN_Msk            (0x1ul << ADC_ADDR0_OVERRUN_Pos)                  /*!< ADC_T::ADDR0: OVERRUN Mask             */

#define ADC_ADDR0_VALID_Pos              (17)                                              /*!< ADC_T::ADDR0: VALID Position           */
#define ADC_ADDR0_VALID_Msk              (0x1ul << ADC_ADDR0_VALID_Pos)                    /*!< ADC_T::ADDR0: VALID Mask               */

#define ADC_ADDR1_RSLT_Pos               (0)                                               /*!< ADC_T::ADDR1: RSLT Position            */
#define ADC_ADDR1_RSLT_Msk               (0xfffful << ADC_ADDR1_RSLT_Pos)                  /*!< ADC_T::ADDR1: RSLT Mask                */

#define ADC_ADDR1_OVERRUN_Pos            (16)                                              /*!< ADC_T::ADDR1: OVERRUN Position         */
#define ADC_ADDR1_OVERRUN_Msk            (0x1ul << ADC_ADDR1_OVERRUN_Pos)                  /*!< ADC_T::ADDR1: OVERRUN Mask             */

#define ADC_ADDR1_VALID_Pos              (17)                                              /*!< ADC_T::ADDR1: VALID Position           */
#define ADC_ADDR1_VALID_Msk              (0x1ul << ADC_ADDR1_VALID_Pos)                    /*!< ADC_T::ADDR1: VALID Mask               */

#define ADC_ADDR2_RSLT_Pos               (0)                                               /*!< ADC_T::ADDR2: RSLT Position            */
#define ADC_ADDR2_RSLT_Msk               (0xfffful << ADC_ADDR2_RSLT_Pos)                  /*!< ADC_T::ADDR2: RSLT Mask                */

#define ADC_ADDR2_OVERRUN_Pos            (16)                                              /*!< ADC_T::ADDR2: OVERRUN Position         */
#define ADC_ADDR2_OVERRUN_Msk            (0x1ul << ADC_ADDR2_OVERRUN_Pos)                  /*!< ADC_T::ADDR2: OVERRUN Mask             */

#define ADC_ADDR2_VALID_Pos              (17)                                              /*!< ADC_T::ADDR2: VALID Position           */
#define ADC_ADDR2_VALID_Msk              (0x1ul << ADC_ADDR2_VALID_Pos)                    /*!< ADC_T::ADDR2: VALID Mask               */

#define ADC_ADDR3_RSLT_Pos               (0)                                               /*!< ADC_T::ADDR3: RSLT Position            */
#define ADC_ADDR3_RSLT_Msk               (0xfffful << ADC_ADDR3_RSLT_Pos)                  /*!< ADC_T::ADDR3: RSLT Mask                */

#define ADC_ADDR3_OVERRUN_Pos            (16)                                              /*!< ADC_T::ADDR3: OVERRUN Position         */
#define ADC_ADDR3_OVERRUN_Msk            (0x1ul << ADC_ADDR3_OVERRUN_Pos)                  /*!< ADC_T::ADDR3: OVERRUN Mask             */

#define ADC_ADDR3_VALID_Pos              (17)                                              /*!< ADC_T::ADDR3: VALID Position           */
#define ADC_ADDR3_VALID_Msk              (0x1ul << ADC_ADDR3_VALID_Pos)                    /*!< ADC_T::ADDR3: VALID Mask               */

