wosayttn/Gerrit_NuMicro/M2003xI_M2003xJ_Series/Library/Device/Nuvoton/M2003J/Include/adc_reg.h
#define ADC_ADDR4_RSLT_Pos               (0)                                               /*!< ADC_T::ADDR4: RSLT Position            */
#define ADC_ADDR4_RSLT_Msk               (0xfffful << ADC_ADDR4_RSLT_Pos)                  /*!< ADC_T::ADDR4: RSLT Mask                */

#define ADC_ADDR4_OVERRUN_Pos            (16)                                              /*!< ADC_T::ADDR4: OVERRUN Position         */
#define ADC_ADDR4_OVERRUN_Msk            (0x1ul << ADC_ADDR4_OVERRUN_Pos)                  /*!< ADC_T::ADDR4: OVERRUN Mask             */

#define ADC_ADDR4_VALID_Pos              (17)                                              /*!< ADC_T::ADDR4: VALID Position           */
#define ADC_ADDR4_VALID_Msk              (0x1ul << ADC_ADDR4_VALID_Pos)                    /*!< ADC_T::ADDR4: VALID Mask               */

#define ADC_ADDR5_RSLT_Pos               (0)                                               /*!< ADC_T::ADDR5: RSLT Position            */
#define ADC_ADDR5_RSLT_Msk               (0xfffful << ADC_ADDR5_RSLT_Pos)                  /*!< ADC_T::ADDR5: RSLT Mask                */

#define ADC_ADDR5_OVERRUN_Pos            (16)                                              /*!< ADC_T::ADDR5: OVERRUN Position         */
#define ADC_ADDR5_OVERRUN_Msk            (0x1ul << ADC_ADDR5_OVERRUN_Pos)                  /*!< ADC_T::ADDR5: OVERRUN Mask             */

#define ADC_ADDR5_VALID_Pos              (17)                                              /*!< ADC_T::ADDR5: VALID Position           */
#define ADC_ADDR5_VALID_Msk              (0x1ul << ADC_ADDR5_VALID_Pos)                    /*!< ADC_T::ADDR5: VALID Mask               */

#define ADC_ADDR6_RSLT_Pos               (0)                                               /*!< ADC_T::ADDR6: RSLT Position            */
#define ADC_ADDR6_RSLT_Msk               (0xfffful << ADC_ADDR6_RSLT_Pos)                  /*!< ADC_T::ADDR6: RSLT Mask                */

#define ADC_ADDR6_OVERRUN_Pos            (16)                                              /*!< ADC_T::ADDR6: OVERRUN Position         */
#define ADC_ADDR6_OVERRUN_Msk            (0x1ul << ADC_ADDR6_OVERRUN_Pos)                  /*!< ADC_T::ADDR6: OVERRUN Mask             */

#define ADC_ADDR6_VALID_Pos              (17)                                              /*!< ADC_T::ADDR6: VALID Position           */
#define ADC_ADDR6_VALID_Msk              (0x1ul << ADC_ADDR6_VALID_Pos)                    /*!< ADC_T::ADDR6: VALID Mask               */

#define ADC_ADDR7_RSLT_Pos               (0)                                               /*!< ADC_T::ADDR7: RSLT Position            */
#define ADC_ADDR7_RSLT_Msk               (0xfffful << ADC_ADDR7_RSLT_Pos)                  /*!< ADC_T::ADDR7: RSLT Mask                */

#define ADC_ADDR7_OVERRUN_Pos            (16)                                              /*!< ADC_T::ADDR7: OVERRUN Position         */
#define ADC_ADDR7_OVERRUN_Msk            (0x1ul << ADC_ADDR7_OVERRUN_Pos)                  /*!< ADC_T::ADDR7: OVERRUN Mask             */

#define ADC_ADDR7_VALID_Pos              (17)                                              /*!< ADC_T::ADDR7: VALID Position           */
#define ADC_ADDR7_VALID_Msk              (0x1ul << ADC_ADDR7_VALID_Pos)                    /*!< ADC_T::ADDR7: VALID Mask               */

#define ADC_ADDR8_RSLT_Pos               (0)                                               /*!< ADC_T::ADDR8: RSLT Position            */
#define ADC_ADDR8_RSLT_Msk               (0xfffful << ADC_ADDR8_RSLT_Pos)                  /*!< ADC_T::ADDR8: RSLT Mask                */

#define ADC_ADDR8_OVERRUN_Pos            (16)                                              /*!< ADC_T::ADDR8: OVERRUN Position         */
#define ADC_ADDR8_OVERRUN_Msk            (0x1ul << ADC_ADDR8_OVERRUN_Pos)                  /*!< ADC_T::ADDR8: OVERRUN Mask             */

#define ADC_ADDR8_VALID_Pos              (17)                                              /*!< ADC_T::ADDR8: VALID Position           */
#define ADC_ADDR8_VALID_Msk              (0x1ul << ADC_ADDR8_VALID_Pos)                    /*!< ADC_T::ADDR8: VALID Mask               */

#define ADC_ADDR9_RSLT_Pos               (0)                                               /*!< ADC_T::ADDR9: RSLT Position            */
#define ADC_ADDR9_RSLT_Msk               (0xfffful << ADC_ADDR9_RSLT_Pos)                  /*!< ADC_T::ADDR9: RSLT Mask                */

#define ADC_ADDR9_OVERRUN_Pos            (16)                                              /*!< ADC_T::ADDR9: OVERRUN Position         */
#define ADC_ADDR9_OVERRUN_Msk            (0x1ul << ADC_ADDR9_OVERRUN_Pos)                  /*!< ADC_T::ADDR9: OVERRUN Mask             */

#define ADC_ADDR9_VALID_Pos              (17)                                              /*!< ADC_T::ADDR9: VALID Position           */
#define ADC_ADDR9_VALID_Msk              (0x1ul << ADC_ADDR9_VALID_Pos)                    /*!< ADC_T::ADDR9: VALID Mask               */

#define ADC_ADDR10_RSLT_Pos              (0)                                               /*!< ADC_T::ADDR10: RSLT Position           */
#define ADC_ADDR10_RSLT_Msk              (0xfffful << ADC_ADDR10_RSLT_Pos)                 /*!< ADC_T::ADDR10: RSLT Mask               */

#define ADC_ADDR10_OVERRUN_Pos           (16)                                              /*!< ADC_T::ADDR10: OVERRUN Position        */
#define ADC_ADDR10_OVERRUN_Msk           (0x1ul << ADC_ADDR10_OVERRUN_Pos)                 /*!< ADC_T::ADDR10: OVERRUN Mask            */

#define ADC_ADDR10_VALID_Pos             (17)                                              /*!< ADC_T::ADDR10: VALID Position          */
#define ADC_ADDR10_VALID_Msk             (0x1ul << ADC_ADDR10_VALID_Pos)                   /*!< ADC_T::ADDR10: VALID Mask              */

#define ADC_ADDR11_RSLT_Pos              (0)                                               /*!< ADC_T::ADDR11: RSLT Position           */
#define ADC_ADDR11_RSLT_Msk              (0xfffful << ADC_ADDR11_RSLT_Pos)                 /*!< ADC_T::ADDR11: RSLT Mask               */

#define ADC_ADDR11_OVERRUN_Pos           (16)                                              /*!< ADC_T::ADDR11: OVERRUN Position        */
#define ADC_ADDR11_OVERRUN_Msk           (0x1ul << ADC_ADDR11_OVERRUN_Pos)                 /*!< ADC_T::ADDR11: OVERRUN Mask            */

#define ADC_ADDR11_VALID_Pos             (17)                                              /*!< ADC_T::ADDR11: VALID Position          */
#define ADC_ADDR11_VALID_Msk             (0x1ul << ADC_ADDR11_VALID_Pos)                   /*!< ADC_T::ADDR11: VALID Mask              */

