wosayttn/Gerrit_NuMicro/M2003xI_M2003xJ_Series/Library/Device/Nuvoton/M2003J/Include/adc_reg.h
#define ADC_ADDR12_RSLT_Pos              (0)                                               /*!< ADC_T::ADDR12: RSLT Position           */
#define ADC_ADDR12_RSLT_Msk              (0xfffful << ADC_ADDR12_RSLT_Pos)                 /*!< ADC_T::ADDR12: RSLT Mask               */

#define ADC_ADDR12_OVERRUN_Pos           (16)                                              /*!< ADC_T::ADDR12: OVERRUN Position        */
#define ADC_ADDR12_OVERRUN_Msk           (0x1ul << ADC_ADDR12_OVERRUN_Pos)                 /*!< ADC_T::ADDR12: OVERRUN Mask            */

#define ADC_ADDR12_VALID_Pos             (17)                                              /*!< ADC_T::ADDR12: VALID Position          */
#define ADC_ADDR12_VALID_Msk             (0x1ul << ADC_ADDR12_VALID_Pos)                   /*!< ADC_T::ADDR12: VALID Mask              */

#define ADC_ADDR13_RSLT_Pos              (0)                                               /*!< ADC_T::ADDR13: RSLT Position           */
#define ADC_ADDR13_RSLT_Msk              (0xfffful << ADC_ADDR13_RSLT_Pos)                 /*!< ADC_T::ADDR13: RSLT Mask               */

#define ADC_ADDR13_OVERRUN_Pos           (16)                                              /*!< ADC_T::ADDR13: OVERRUN Position        */
#define ADC_ADDR13_OVERRUN_Msk           (0x1ul << ADC_ADDR13_OVERRUN_Pos)                 /*!< ADC_T::ADDR13: OVERRUN Mask            */

#define ADC_ADDR13_VALID_Pos             (17)                                              /*!< ADC_T::ADDR13: VALID Position          */
#define ADC_ADDR13_VALID_Msk             (0x1ul << ADC_ADDR13_VALID_Pos)                   /*!< ADC_T::ADDR13: VALID Mask              */

#define ADC_ADDR14_RSLT_Pos              (0)                                               /*!< ADC_T::ADDR14: RSLT Position           */
#define ADC_ADDR14_RSLT_Msk              (0xfffful << ADC_ADDR14_RSLT_Pos)                 /*!< ADC_T::ADDR14: RSLT Mask               */

#define ADC_ADDR14_OVERRUN_Pos           (16)                                              /*!< ADC_T::ADDR14: OVERRUN Position        */
#define ADC_ADDR14_OVERRUN_Msk           (0x1ul << ADC_ADDR14_OVERRUN_Pos)                 /*!< ADC_T::ADDR14: OVERRUN Mask            */

#define ADC_ADDR14_VALID_Pos             (17)                                              /*!< ADC_T::ADDR14: VALID Position          */
#define ADC_ADDR14_VALID_Msk             (0x1ul << ADC_ADDR14_VALID_Pos)                   /*!< ADC_T::ADDR14: VALID Mask              */

#define ADC_ADDR15_RSLT_Pos              (0)                                               /*!< ADC_T::ADDR15: RSLT Position           */
#define ADC_ADDR15_RSLT_Msk              (0xfffful << ADC_ADDR15_RSLT_Pos)                 /*!< ADC_T::ADDR15: RSLT Mask               */

#define ADC_ADDR15_OVERRUN_Pos           (16)                                              /*!< ADC_T::ADDR15: OVERRUN Position        */
#define ADC_ADDR15_OVERRUN_Msk           (0x1ul << ADC_ADDR15_OVERRUN_Pos)                 /*!< ADC_T::ADDR15: OVERRUN Mask            */

#define ADC_ADDR15_VALID_Pos             (17)                                              /*!< ADC_T::ADDR15: VALID Position          */
#define ADC_ADDR15_VALID_Msk             (0x1ul << ADC_ADDR15_VALID_Pos)                   /*!< ADC_T::ADDR15: VALID Mask              */

#define ADC_ADDR16_RSLT_Pos              (0)                                               /*!< ADC_T::ADDR16: RSLT Position           */
#define ADC_ADDR16_RSLT_Msk              (0xfffful << ADC_ADDR16_RSLT_Pos)                 /*!< ADC_T::ADDR16: RSLT Mask               */

#define ADC_ADDR16_OVERRUN_Pos           (16)                                              /*!< ADC_T::ADDR16: OVERRUN Position        */
#define ADC_ADDR16_OVERRUN_Msk           (0x1ul << ADC_ADDR16_OVERRUN_Pos)                 /*!< ADC_T::ADDR16: OVERRUN Mask            */

#define ADC_ADDR16_VALID_Pos             (17)                                              /*!< ADC_T::ADDR16: VALID Position          */
#define ADC_ADDR16_VALID_Msk             (0x1ul << ADC_ADDR16_VALID_Pos)                   /*!< ADC_T::ADDR16: VALID Mask              */

#define ADC_ADDR17_RSLT_Pos              (0)                                               /*!< ADC_T::ADDR17: RSLT Position           */
#define ADC_ADDR17_RSLT_Msk              (0xfffful << ADC_ADDR17_RSLT_Pos)                 /*!< ADC_T::ADDR17: RSLT Mask               */

#define ADC_ADDR17_OVERRUN_Pos           (16)                                              /*!< ADC_T::ADDR17: OVERRUN Position        */
#define ADC_ADDR17_OVERRUN_Msk           (0x1ul << ADC_ADDR17_OVERRUN_Pos)                 /*!< ADC_T::ADDR17: OVERRUN Mask            */

#define ADC_ADDR17_VALID_Pos             (17)                                              /*!< ADC_T::ADDR17: VALID Position          */
#define ADC_ADDR17_VALID_Msk             (0x1ul << ADC_ADDR17_VALID_Pos)                   /*!< ADC_T::ADDR17: VALID Mask              */

#define ADC_ADDR18_RSLT_Pos              (0)                                               /*!< ADC_T::ADDR18: RSLT Position           */
#define ADC_ADDR18_RSLT_Msk              (0xfffful << ADC_ADDR18_RSLT_Pos)                 /*!< ADC_T::ADDR18: RSLT Mask               */

#define ADC_ADDR18_OVERRUN_Pos           (16)                                              /*!< ADC_T::ADDR18: OVERRUN Position        */
#define ADC_ADDR18_OVERRUN_Msk           (0x1ul << ADC_ADDR18_OVERRUN_Pos)                 /*!< ADC_T::ADDR18: OVERRUN Mask            */

#define ADC_ADDR18_VALID_Pos             (17)                                              /*!< ADC_T::ADDR18: VALID Position          */
#define ADC_ADDR18_VALID_Msk             (0x1ul << ADC_ADDR18_VALID_Pos)                   /*!< ADC_T::ADDR18: VALID Mask              */

#define ADC_ADDR19_RSLT_Pos              (0)                                               /*!< ADC_T::ADDR19: RSLT Position           */
#define ADC_ADDR19_RSLT_Msk              (0xfffful << ADC_ADDR19_RSLT_Pos)                 /*!< ADC_T::ADDR19: RSLT Mask               */

#define ADC_ADDR19_OVERRUN_Pos           (16)                                              /*!< ADC_T::ADDR19: OVERRUN Position        */
#define ADC_ADDR19_OVERRUN_Msk           (0x1ul << ADC_ADDR19_OVERRUN_Pos)                 /*!< ADC_T::ADDR19: OVERRUN Mask            */

#define ADC_ADDR19_VALID_Pos             (17)                                              /*!< ADC_T::ADDR19: VALID Position          */
#define ADC_ADDR19_VALID_Msk             (0x1ul << ADC_ADDR19_VALID_Pos)                   /*!< ADC_T::ADDR19: VALID Mask              */

#define ADC_ADDR20_RSLT_Pos              (0)                                               /*!< ADC_T::ADDR20: RSLT Position           */
#define ADC_ADDR20_RSLT_Msk              (0xfffful << ADC_ADDR20_RSLT_Pos)                 /*!< ADC_T::ADDR20: RSLT Mask               */

#define ADC_ADDR20_OVERRUN_Pos           (16)                                              /*!< ADC_T::ADDR20: OVERRUN Position        */
#define ADC_ADDR20_OVERRUN_Msk           (0x1ul << ADC_ADDR20_OVERRUN_Pos)                 /*!< ADC_T::ADDR20: OVERRUN Mask            */

#define ADC_ADDR20_VALID_Pos             (17)                                              /*!< ADC_T::ADDR20: VALID Position          */
#define ADC_ADDR20_VALID_Msk             (0x1ul << ADC_ADDR20_VALID_Pos)                   /*!< ADC_T::ADDR20: VALID Mask              */

#define ADC_ADDR21_RSLT_Pos              (0)                                               /*!< ADC_T::ADDR21: RSLT Position           */
#define ADC_ADDR21_RSLT_Msk              (0xfffful << ADC_ADDR21_RSLT_Pos)                 /*!< ADC_T::ADDR21: RSLT Mask               */

#define ADC_ADDR21_OVERRUN_Pos           (16)                                              /*!< ADC_T::ADDR21: OVERRUN Position        */
#define ADC_ADDR21_OVERRUN_Msk           (0x1ul << ADC_ADDR21_OVERRUN_Pos)                 /*!< ADC_T::ADDR21: OVERRUN Mask            */

#define ADC_ADDR21_VALID_Pos             (17)                                              /*!< ADC_T::ADDR21: VALID Position          */
#define ADC_ADDR21_VALID_Msk             (0x1ul << ADC_ADDR21_VALID_Pos)                   /*!< ADC_T::ADDR21: VALID Mask              */

#define ADC_ADDR22_RSLT_Pos              (0)                                               /*!< ADC_T::ADDR22: RSLT Position           */
#define ADC_ADDR22_RSLT_Msk              (0xfffful << ADC_ADDR22_RSLT_Pos)                 /*!< ADC_T::ADDR22: RSLT Mask               */

