wosayttn/Gerrit_NuMicro/M2003xI_M2003xJ_Series/Library/Device/Nuvoton/M2003J/Include/adc_reg.h
#define ADC_ADDR22_OVERRUN_Pos           (16)                                              /*!< ADC_T::ADDR22: OVERRUN Position        */
#define ADC_ADDR22_OVERRUN_Msk           (0x1ul << ADC_ADDR22_OVERRUN_Pos)                 /*!< ADC_T::ADDR22: OVERRUN Mask            */

#define ADC_ADDR22_VALID_Pos             (17)                                              /*!< ADC_T::ADDR22: VALID Position          */
#define ADC_ADDR22_VALID_Msk             (0x1ul << ADC_ADDR22_VALID_Pos)                   /*!< ADC_T::ADDR22: VALID Mask              */

#define ADC_ADDR23_RSLT_Pos              (0)                                               /*!< ADC_T::ADDR23: RSLT Position           */
#define ADC_ADDR23_RSLT_Msk              (0xfffful << ADC_ADDR23_RSLT_Pos)                 /*!< ADC_T::ADDR23: RSLT Mask               */

#define ADC_ADDR23_OVERRUN_Pos           (16)                                              /*!< ADC_T::ADDR23: OVERRUN Position        */
#define ADC_ADDR23_OVERRUN_Msk           (0x1ul << ADC_ADDR23_OVERRUN_Pos)                 /*!< ADC_T::ADDR23: OVERRUN Mask            */

#define ADC_ADDR23_VALID_Pos             (17)                                              /*!< ADC_T::ADDR23: VALID Position          */
#define ADC_ADDR23_VALID_Msk             (0x1ul << ADC_ADDR23_VALID_Pos)                   /*!< ADC_T::ADDR23: VALID Mask              */

#define ADC_ADDR29_RSLT_Pos              (0)                                               /*!< ADC_T::ADDR29: RSLT Position           */
#define ADC_ADDR29_RSLT_Msk              (0xfffful << ADC_ADDR29_RSLT_Pos)                 /*!< ADC_T::ADDR29: RSLT Mask               */

#define ADC_ADDR29_OVERRUN_Pos           (16)                                              /*!< ADC_T::ADDR29: OVERRUN Position        */
#define ADC_ADDR29_OVERRUN_Msk           (0x1ul << ADC_ADDR29_OVERRUN_Pos)                 /*!< ADC_T::ADDR29: OVERRUN Mask            */

#define ADC_ADDR29_VALID_Pos             (17)                                              /*!< ADC_T::ADDR29: VALID Position          */
#define ADC_ADDR29_VALID_Msk             (0x1ul << ADC_ADDR29_VALID_Pos)                   /*!< ADC_T::ADDR29: VALID Mask              */

#define ADC_ADCR_ADEN_Pos                (0)                                               /*!< ADC_T::ADCR: ADEN Position             */
#define ADC_ADCR_ADEN_Msk                (0x1ul << ADC_ADCR_ADEN_Pos)                      /*!< ADC_T::ADCR: ADEN Mask                 */

#define ADC_ADCR_ADIE_Pos                (1)                                               /*!< ADC_T::ADCR: ADIE Position             */
#define ADC_ADCR_ADIE_Msk                (0x1ul << ADC_ADCR_ADIE_Pos)                      /*!< ADC_T::ADCR: ADIE Mask                 */

#define ADC_ADCR_ADMD_Pos                (2)                                               /*!< ADC_T::ADCR: ADMD Position             */
#define ADC_ADCR_ADMD_Msk                (0x3ul << ADC_ADCR_ADMD_Pos)                      /*!< ADC_T::ADCR: ADMD Mask                 */

#define ADC_ADCR_TRGCOND_Pos             (6)                                               /*!< ADC_T::ADCR: TRGCOND Position          */
#define ADC_ADCR_TRGCOND_Msk             (0x3ul << ADC_ADCR_TRGCOND_Pos)                   /*!< ADC_T::ADCR: TRGCOND Mask              */

#define ADC_ADCR_TRGEN_Pos               (8)                                               /*!< ADC_T::ADCR: TRGEN Position            */
#define ADC_ADCR_TRGEN_Msk               (0x1ul << ADC_ADCR_TRGEN_Pos)                     /*!< ADC_T::ADCR: TRGEN Mask                */

#define ADC_ADCR_PTEN_Pos                (9)                                               /*!< ADC_T::ADCR: PTEN Position             */
#define ADC_ADCR_PTEN_Msk                (0x1ul << ADC_ADCR_PTEN_Pos)                      /*!< ADC_T::ADCR: PTEN Mask                 */

#define ADC_ADCR_ADST_Pos                (11)                                              /*!< ADC_T::ADCR: ADST Position             */
#define ADC_ADCR_ADST_Msk                (0x1ul << ADC_ADCR_ADST_Pos)                      /*!< ADC_T::ADCR: ADST Mask                 */

#define ADC_ADCR_ADDRRST_Pos             (14)                                              /*!< ADC_T::ADCR: ADDRRST Position          */
#define ADC_ADCR_ADDRRST_Msk             (0x1ul << ADC_ADCR_ADDRRST_Pos)                   /*!< ADC_T::ADCR: ADDRRST Mask              */

#define ADC_ADCR_TRGS_Pos                (16)                                              /*!< ADC_T::ADCR: TRGS Position             */
#define ADC_ADCR_TRGS_Msk                (0xful << ADC_ADCR_TRGS_Pos)                      /*!< ADC_T::ADCR: TRGS Mask                 */

#define ADC_ADCR_STBSEL_Pos              (24)                                              /*!< ADC_T::ADCR: STBSEL Position           */
#define ADC_ADCR_STBSEL_Msk              (0x3ul << ADC_ADCR_STBSEL_Pos)                    /*!< ADC_T::ADCR: STBSEL Mask               */

#define ADC_ADCHER_CHEN_Pos              (0)                                               /*!< ADC_T::ADCHER: CHEN Position           */
#define ADC_ADCHER_CHEN_Msk              (0xfffffffful << ADC_ADCHER_CHEN_Pos)             /*!< ADC_T::ADCHER: CHEN Mask               */

#define ADC_ADCMPR_CMPEN_Pos             (0)                                               /*!< ADC_T::ADCMPR: CMPEN Position         */
#define ADC_ADCMPR_CMPEN_Msk             (0x1ul << ADC_ADCMPR_CMPEN_Pos)                   /*!< ADC_T::ADCMPR: CMPEN Mask             */

#define ADC_ADCMPR_CMPIE_Pos             (1)                                               /*!< ADC_T::ADCMPR: CMPIE Position         */
#define ADC_ADCMPR_CMPIE_Msk             (0x1ul << ADC_ADCMPR_CMPIE_Pos)                   /*!< ADC_T::ADCMPR: CMPIE Mask             */

#define ADC_ADCMPR_CMPCOND_Pos           (2)                                               /*!< ADC_T::ADCMPR: CMPCOND Position       */
#define ADC_ADCMPR_CMPCOND_Msk           (0x1ul << ADC_ADCMPR_CMPCOND_Pos)                 /*!< ADC_T::ADCMPR: CMPCOND Mask           */

#define ADC_ADCMPR_CMPCH_Pos             (3)                                               /*!< ADC_T::ADCMPR: CMPCH Position         */
#define ADC_ADCMPR_CMPCH_Msk             (0x1ful << ADC_ADCMPR_CMPCH_Pos)                  /*!< ADC_T::ADCMPR: CMPCH Mask             */

