wosayttn/Gerrit_NuMicro/M2003xI_M2003xJ_Series/Library/Device/Nuvoton/M2003J/Include/adc_reg.h
#define ADC_ADCMPR_CMPMCNT_Pos           (8)                                               /*!< ADC_T::ADCMPR: CMPMCNT Position       */
#define ADC_ADCMPR_CMPMCNT_Msk           (0xful << ADC_ADCMPR_CMPMCNT_Pos)                 /*!< ADC_T::ADCMPR: CMPMCNT Mask           */

#define ADC_ADCMPR_CMPWEN_Pos            (15)                                              /*!< ADC_T::ADCMPR: CMPWEN Position        */
#define ADC_ADCMPR_CMPWEN_Msk            (0x1ul << ADC_ADCMPR_CMPWEN_Pos)                  /*!< ADC_T::ADCMPR: CMPWEN Mask            */

#define ADC_ADCMPR_CMPD_Pos              (16)                                              /*!< ADC_T::ADCMPR: CMPD Position          */
#define ADC_ADCMPR_CMPD_Msk              (0xffful << ADC_ADCMPR_CMPD_Pos)                  /*!< ADC_T::ADCMPR: CMPD Mask              */

#define ADC_ADCMPR0_CMPEN_Pos            (0)                                               /*!< ADC_T::ADCMPR0: CMPEN Position         */
#define ADC_ADCMPR0_CMPEN_Msk            (0x1ul << ADC_ADCMPR0_CMPEN_Pos)                  /*!< ADC_T::ADCMPR0: CMPEN Mask             */

#define ADC_ADCMPR0_CMPIE_Pos            (1)                                               /*!< ADC_T::ADCMPR0: CMPIE Position         */
#define ADC_ADCMPR0_CMPIE_Msk            (0x1ul << ADC_ADCMPR0_CMPIE_Pos)                  /*!< ADC_T::ADCMPR0: CMPIE Mask             */

#define ADC_ADCMPR0_CMPCOND_Pos          (2)                                               /*!< ADC_T::ADCMPR0: CMPCOND Position       */
#define ADC_ADCMPR0_CMPCOND_Msk          (0x1ul << ADC_ADCMPR0_CMPCOND_Pos)                /*!< ADC_T::ADCMPR0: CMPCOND Mask           */

#define ADC_ADCMPR0_CMPCH_Pos            (3)                                               /*!< ADC_T::ADCMPR0: CMPCH Position         */
#define ADC_ADCMPR0_CMPCH_Msk            (0x1ful << ADC_ADCMPR0_CMPCH_Pos)                 /*!< ADC_T::ADCMPR0: CMPCH Mask             */

#define ADC_ADCMPR0_CMPMCNT_Pos          (8)                                               /*!< ADC_T::ADCMPR0: CMPMCNT Position       */
#define ADC_ADCMPR0_CMPMCNT_Msk          (0xful << ADC_ADCMPR0_CMPMCNT_Pos)                /*!< ADC_T::ADCMPR0: CMPMCNT Mask           */

#define ADC_ADCMPR0_CMPWEN_Pos           (15)                                              /*!< ADC_T::ADCMPR0: CMPWEN Position        */
#define ADC_ADCMPR0_CMPWEN_Msk           (0x1ul << ADC_ADCMPR0_CMPWEN_Pos)                 /*!< ADC_T::ADCMPR0: CMPWEN Mask            */

#define ADC_ADCMPR0_CMPD_Pos             (16)                                              /*!< ADC_T::ADCMPR0: CMPD Position          */
#define ADC_ADCMPR0_CMPD_Msk             (0xffful << ADC_ADCMPR0_CMPD_Pos)                 /*!< ADC_T::ADCMPR0: CMPD Mask              */

#define ADC_ADCMPR1_CMPEN_Pos            (0)                                               /*!< ADC_T::ADCMPR1: CMPEN Position         */
#define ADC_ADCMPR1_CMPEN_Msk            (0x1ul << ADC_ADCMPR1_CMPEN_Pos)                  /*!< ADC_T::ADCMPR1: CMPEN Mask             */

#define ADC_ADCMPR1_CMPIE_Pos            (1)                                               /*!< ADC_T::ADCMPR1: CMPIE Position         */
#define ADC_ADCMPR1_CMPIE_Msk            (0x1ul << ADC_ADCMPR1_CMPIE_Pos)                  /*!< ADC_T::ADCMPR1: CMPIE Mask             */

#define ADC_ADCMPR1_CMPCOND_Pos          (2)                                               /*!< ADC_T::ADCMPR1: CMPCOND Position       */
#define ADC_ADCMPR1_CMPCOND_Msk          (0x1ul << ADC_ADCMPR1_CMPCOND_Pos)                /*!< ADC_T::ADCMPR1: CMPCOND Mask           */

#define ADC_ADCMPR1_CMPCH_Pos            (3)                                               /*!< ADC_T::ADCMPR1: CMPCH Position         */
#define ADC_ADCMPR1_CMPCH_Msk            (0x1ful << ADC_ADCMPR1_CMPCH_Pos)                 /*!< ADC_T::ADCMPR1: CMPCH Mask             */

#define ADC_ADCMPR1_CMPMCNT_Pos          (8)                                               /*!< ADC_T::ADCMPR1: CMPMCNT Position       */
#define ADC_ADCMPR1_CMPMCNT_Msk          (0xful << ADC_ADCMPR1_CMPMCNT_Pos)                /*!< ADC_T::ADCMPR1: CMPMCNT Mask           */

#define ADC_ADCMPR1_CMPWEN_Pos           (15)                                              /*!< ADC_T::ADCMPR1: CMPWEN Position        */
#define ADC_ADCMPR1_CMPWEN_Msk           (0x1ul << ADC_ADCMPR1_CMPWEN_Pos)                 /*!< ADC_T::ADCMPR1: CMPWEN Mask            */

#define ADC_ADCMPR1_CMPD_Pos             (16)                                              /*!< ADC_T::ADCMPR1: CMPD Position          */
#define ADC_ADCMPR1_CMPD_Msk             (0xffful << ADC_ADCMPR1_CMPD_Pos)                 /*!< ADC_T::ADCMPR1: CMPD Mask              */

#define ADC_ADSR0_ADF_Pos                (0)                                               /*!< ADC_T::ADSR0: ADF Position             */
#define ADC_ADSR0_ADF_Msk                (0x1ul << ADC_ADSR0_ADF_Pos)                      /*!< ADC_T::ADSR0: ADF Mask                 */

#define ADC_ADSR0_CMPF0_Pos              (1)                                               /*!< ADC_T::ADSR0: CMPF0 Position           */
#define ADC_ADSR0_CMPF0_Msk              (0x1ul << ADC_ADSR0_CMPF0_Pos)                    /*!< ADC_T::ADSR0: CMPF0 Mask               */

#define ADC_ADSR0_CMPF1_Pos              (2)                                               /*!< ADC_T::ADSR0: CMPF1 Position           */
#define ADC_ADSR0_CMPF1_Msk              (0x1ul << ADC_ADSR0_CMPF1_Pos)                    /*!< ADC_T::ADSR0: CMPF1 Mask               */

#define ADC_ADSR0_BUSY_Pos               (7)                                               /*!< ADC_T::ADSR0: BUSY Position            */
#define ADC_ADSR0_BUSY_Msk               (0x1ul << ADC_ADSR0_BUSY_Pos)                     /*!< ADC_T::ADSR0: BUSY Mask                */

#define ADC_ADSR0_VALIDF_Pos             (8)                                               /*!< ADC_T::ADSR0: VALIDF Position          */
#define ADC_ADSR0_VALIDF_Msk             (0x1ul << ADC_ADSR0_VALIDF_Pos)                   /*!< ADC_T::ADSR0: VALIDF Mask              */

#define ADC_ADSR0_OVERRUNF_Pos           (16)                                              /*!< ADC_T::ADSR0: OVERRUNF Position        */
#define ADC_ADSR0_OVERRUNF_Msk           (0x1ul << ADC_ADSR0_OVERRUNF_Pos)                 /*!< ADC_T::ADSR0: OVERRUNF Mask            */

